app/controllers/business_managers_controller.rb

  def index
      business_managers = BusinessManager.all.paginate(page: params[:page],per_page: 10)
---
SELECT  "business_managers".* FROM "business_managers" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

  def show
      business_manager = BusinessManager.find(params[:id])
---
SELECT  "business_managers".* FROM "business_managers" WHERE "business_managers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]