app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies"
---
    def index
        companies = Company.all

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def show
        company = Company.find(params[:id])

INSERT INTO "companies" ("name", "location", "companyType", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "company funny name"], ["location", "carrera 1-19"], ["companyType", "food products"], ["created_at", "2018-10-01 02:10:53.498183"], ["updated_at", "2018-10-01 02:10:53.498183"]]
---
    def create
        company = Company.new(params_company)
        if company.save

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "companies" SET "name" = ?, "updated_at" = ? WHERE "companies"."id" = ?  [["name", "really weird company name"], ["updated_at", "2018-10-01 02:12:52.772497"], ["id", 2]]
---
    def update
        company = Company.find(params[:id])
        company.update(params_company)