app/controllers/distributors_controller.rb

    def index
        distributors = Distributor.all.paginate(page: params[:page],per_page: 10)
---
SELECT  "distributors".* FROM "distributors" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

    def show
        distributor = Distributor.find(params[:id])
---
SELECT  "distributors".* FROM "distributors" WHERE "distributors"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

    def getMessages
        distributor = Distributor.find(params[:id])
---
SELECT  "distributors".* FROM "distributors" WHERE "distributors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]