app/controllers/messages_controller.rb

SELECT  "messages".* FROM "messages" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
    def index
        messages = Message.all.paginate(page: params[:page],per_page: 10)