app/controllers/offers_controller.rb

    def index
        offer = Offer.all.paginate(page: params[:page],per_page: 10)
---
SELECT "offers".* FROM "offers"

    def show
        offer = Offer.find(params[:id])
---
SELECT  "offers".* FROM "offers" WHERE "offers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        offer = Offer.find(params[:id])
---
SELECT  "offers".* FROM "offers" WHERE "offers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def destroy

        offer = Offer.find(params[:id])
        offer.destroy
---
SELECT  "offers".* FROM "offers" WHERE "offers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "offers" WHERE "offers"."id" = ?  [["id", 1]]