app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"
---
    def index
        orders = Order.all.paginate(page: params[:page],per_page: 10)