app/controllers/products_controller.rb

SELECT  "distributors".* FROM "distributors" WHERE "distributors"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "products" ("price", "producType", "brand", "productName", "quantity", "description", "created_at", "updated_at", "distributor_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        distributor = Distributor.find(params[:distributor_id])
        product = distributor.products.new(params_product)
        user = User.find(distributor.user_id)
        if product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]
---
    def destroy
        distributor = Distributor.find(params[:distributor_id])
        product = distributor.products.find(params[:id])
        product.destroy

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "products" SET "price" = ?, "productName" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", 13000.0], ["productName", "jamaballo"], ["updated_at", "2018-10-01 02:20:26.363408"], ["id", 2]]
---
    def update
        distributor = Distributor.find(params[:distributor_id])
        product = distributor.products.find(params[:id])
        if product.update(params_product)

SELECT  "distributors".* FROM "distributors" WHERE "distributors"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."distributor_id" = ?  [["distributor_id", 5]]
---
    def find_highest

        distributor = Distributor.find(params[:distributor_id])
        product = Product.findHighest(distributor.id)