app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
    def index
        users = User.all.paginate(page: params[:page],per_page: 10)

INSERT INTO "users" ("name", "location", "email", "phone", "userType", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "distributors" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2018-10-14 03:53:01.871370"], ["updated_at", "2018-10-14 03:53:01.871370"], ["user_id", 11]]
INSERT INTO "business_managers" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2018-10-14 14:14:44.503267"], ["updated_at", "2018-10-14 14:14:44.503267"], ["user_id", 12]]
---
    def create
        user = User.new(params_user)

        if user.save

            if(user.userType == "distributor")

                distributor = Distributor.new(user_id: user.id)

                if distributor.save
                    respond_to do |format|
                        format.json {render json: distributor, status: 201}
                    end
                else
                    respond_to do |format|
                        format.json {render json: distributor.errors, status: :unprocessable_entity}
                    end
                end

            elsif(user.userType == "businessmanager")

                business_manager = BusinessManager.new(user_id: user.id)

                if business_manager.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "phone" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "second funny name"], ["phone", 987654321], ["updated_at", "2018-10-01 00:43:29.640275"], ["id", 2]]
---
    def update
        user = User.find(params[:id])
        user.update(params_user)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "business_managers".* FROM "business_managers" WHERE "business_managers"."user_id" = ?  [["user_id", 13]]
SELECT "distributors".* FROM "distributors" WHERE "distributors"."user_id" = ?  [["user_id", 12]]
SELECT COUNT(*) FROM "business_managers" WHERE "business_managers"."user_id" = ?  [["user_id", 13]]
---
    def getUserType
        user = User.find(params[:id])
        business_manager = User.findBusinessManager(user.id)
        distributor = User.findDistributor(user.id)
        if business_manager.empty?